yuanluw/flyscan/User/tm4c_int.c
#include "User/inc_config.h"
#include "User/tm4c_int.h"

// ulStatus = GPIOIntStatus(GPIO_PORTG_BASE, true); // 读取中断状态
//    GPIOIntClear(GPIO_PORTG_BASE, ulStatus); // 清除中断状态，重要



void  SysTick_Handler(void){}    
void  GPIOA_Handler(void){}      
// void  GPIOB_Handler(void){}    
void  GPIOC_Handler(void){}    
void  GPIOD_Handler(void){}    
void  GPIOE_Handler(void){}     
// void  UART0_Handler(void){}        
void  UART1_Handler(void){}
void  SSI0_Handler(void){}         
void  I2C0_Handler(void){}         
void  PWM0_Fault_Handler(void){}   
void  PWM0_G0_Handler(void){}      
void  PWM0_G1_Handler(void){}      
void  PWM0_G2_Handler(void){}      
void  QE_Handler(void){}           
void  ADC0_S0_Handler(void){}      
void  ADC0_S1_Handler(void){}      
void  ADC0_S2_Handler(void){}      
void  ADC0_S3_Handler(void){}      
void  WDOG_Timer_Handler(void){} 
void  TIMER0_STA_Handler(void){}   
void  TIMER0_STB_Handler(void){}  
void  TIMER1_STA_Handler(void){}   
void  TIMER1_STB_Handler(void){}   
void  TIMER2_STA_Handler(void){}   
void  TIMER2_STB_Handler(void){}
void  COMP0_Handler(void){}     
void  COMP1_Handler(void){}     
void  COMP2_Handler(void){}     
void  SYSCTL_Handler(void){}    
void  FLASH_Handler(void){}     
void  GPIOF_Handler(void){}     
// void  GPIOG_Handler(void){}     
void  GPIOH_Handler(void){}     
void  UART2_Handler(void){}     
void  SSI1_Handler(void){}      
void  TIMER3_STA_Handler(void){}
void  TIMER3_STB_Handler(void){}
void  I2C1_Handler(void){}      
void  QE1_Handler(void){}       
void  CAN0_Handler(void){}      
void  CA1_Handler(void){}       
void  CA2_Handler(void){}       
void  Ethernet_Handler(void){}  
void  Hibernate_Handler(void){} 
void  USB0_Handler(void){}      
void  PWM_G3_Handler(void){}    
void  UDMA_SUCCESS_Handler(void){}
void  UDMA_ERROR_Handler(void){}
void  ADC1_S0_Handler(void){}   
void  ADC1_S1_Handler(void){}   
void  ADC1_S2_Handler(void){}   
void  ADC1_S3_Handler(void){}   
void  I2S0_Handler(void){}      
void  EBI0_Handler(void){}      
// void  GPIOJ_Handler(void){}     
void  GPIOK_Handler(void){}     
void  GPIOL_Handler(void){}     
void  SSI2_Handler(void){}      
void  SSI3_Handler(void){}      
void  UART3_Handler(void){}     
void  UART4_Handler(void){}     
void  UART5_Handler(void){}     
void  UART6_Handler(void){}     
void  UART7_Handler(void){}         
void  I2C2_Handler(void){}      
void  I2C3_Handler(void){}      
// void  TIMER4_STA_Handler(void){}
void  TIMER4_STB_Handler(void){}    
void  TIMER5_STA_Handler(void){}
void  TIMER5_STB_Handler(void){}
void  WTIMER0_STA_Handler(void){}
void  WTIMER0_STB_Handler(void){}
void  WTIMER1_STA_Handler(void){}
void  WTIMER1_STB_Handler(void){}
void  WTIMER2_STA_Handler(void){}
void  WTIMER2_STB_Handler(void){}
void  WTIMER3_STA_Handler(void){}
void  WTIMER3_STB_Handler(void){}
void  WTIMER4_STA_Handler(void){}
void  WTIMER4_STB_Handler(void){}
void  WTIMER5_STA_Handler(void){}
void  WTIMER5_STB_Handler(void){}
void  FPU_Handler(void){}       
void  PECI0_Handler(void){}     
void  LPC0_Handler(void){}      
void  I2C4_Handler(void){}      
void  I2C5_Handler(void){}      
void  GPIOM_Handler(void){}     
void  GPION_Handler(void){}     
void  QE2_Handler(void){}       
void  Fan0_Handler(void){}          
void  GPIOP0_Handler(void){}    
void  GPIOP1_Handler(void){}    
void  GPIOP2_Handler(void){}    
void  GPIOP3_Handler(void){}    
void  GPIOP4_Handler(void){}    
void  GPIOP5_Handler(void){}    
void  GPIOP6_Handler(void){}    
void  GPIOP7_Handler(void){}    
void  GPIOQ0_Handler(void){}    
void  GPIOQ1_Handler(void){}    
void  GPIOQ2_Handler(void){}    
void  GPIOQ3_Handler(void){}    
void  GPIOQ4_Handler(void){}    
void  GPIOQ5_Handler(void){}    
void  GPIOQ6_Handler(void){}    
void  GPIOQ7_Handler(void){}    
void  GPIOR_Handler(void){}     
void  GPIOS_Handler(void){}     
void  PWM1_G0_Handler(void){}   
void  PWM1_G1_Handler(void){}   
void  PWM1_G2_Handler(void){}   
void  PWM1_G3_Handler(void){}   
void  PWM1_Fault_Handler(void){}




